# St7GetVertexType

Returns the type assigned to the specified vertex.

long St7GetVertexType(long uID, long VertexNum, long* VertexType)

Input Parameters

uID

Strand7 model file ID.

VertexNum

Vertex number.

Output Parameters
VertexType

Vertex type; either vtFree or vtFixed.